Repository: Amereyeu/appeditor
Catalog: po/*.po
Languages: cs

source: Edit application menu
cs: Upravit menu aplikací

source: Edit application entries shown in application menu and their properties.
cs: Upravit položky aplikací zobrazené v menu a jejich vlastnosti.

source: Features include:
cs: Mezi vlastnosti patří:

source: Hide and show applications from the application menu
cs: Skrýt a zobrazit aplikace z nabídky aplikací

source: Create new application entries
cs: Vytvořit nové položky

source: Change application's display name, icon and more
cs: Změňit zobrazovaný název aplikace, ikonu a další

source: This release includes added support for elementary OS Juno, miscellaneous improvements and new translations:
cs: Tato verze obsahuje přidanou podporu pro OS Juno, různá vylepšení a nové překlady:

source: German translation (ChristianPauly)
cs: Německý překlad (ChristianPauly)

source: Japanese translation (Ryo Nakano)
cs: Japonský překlad (Ryo Nakano)

source: Brazilian Portuguese translation (Filipe de Almeida Garrett)
cs: Překlad do brazilské portugalštiny (Filipe de Almeida Garrett)

source: New features:
cs: Nové vlastnosti:

source: It is now possible to create a menu entry directly from the file manager: right click on an executable file and choose "Create a Menu Entry"
cs: Nyní je možné vytvořit položku nabídky přímo ze správce souborů: klikněte pravým tlačítkem myši na spustitelný soubor a zvolte "Vytvořit položku nabídky"

source: New shortcuts added:
cs: Přidány nové zkratky:

source: Ctrl+N: Create a new menu entry
cs: Ctrl+N: Vytvořit novou položku nabídky

source: Ctrl+F: Focus the search entry
cs: Ctrl+F: Fokus na hledanou položku

source: Ctrl+D: Duplicate selected entry
cs: Ctrl+D: Duplikovat vybranou položku

source: Fixed:
cs: Opraveno:

source: Some strings are not displayed in translated languages (Ryo Nakano)
cs: Některé řetězce se nezobrazují v přeložených jazycích (Ryo Nakano)

source: Improper escaping of special characters in display name and description
cs: Nesprávné escapování speciálních znaků v zobrazovaném názvu a popisu

source: This release contains many new features and bug fixes as well as added suport for translations:
cs: Toto vydání obsahuje mnoho nových funkcí a oprav chyb a také podporu pro překlady:

source: French translation (dabou)
cs: Francouzský překlad (dabou)

source: Russian translation (Cammelan)
cs: Ruský překlad (Cammelan)

source: Spanish translation (Juan Gómez Carrillo)
cs: Španělský překlad (Juan Gómez Carrillo)

source: Added a button to duplicate a specifc application entry
cs: Přidáno tlačítko pro duplikování konkrétní položky aplikace

source: New "Advanced" section: add a new "Uses Notitifications" key
cs: Nová sekce „Pokročilé“: přidán nový klíč „Používá oznámení“

source: Fixed crashes when saving an entry with an equal sign in its command line property
cs: Opravena chyba při ukládání položky se znaménkem "rovná se" v příkazovém řádku

source: Sometimes deleting a local entry would cause it to stay in the sidebar until the next launch
cs: Někdy by odstranění místní položky způsobilo, že by zůstala v postranním panelu až do příštího spuštění

source: Sometimes creating a new entry caused a crash
cs: Někdy vytvoření nového záznamu způsobilo selhání programu

source: The page would not update after saving the entry
cs: Po uložení záznamu se stránka neaktualizuje

source: Miscellaneous:
cs: Různé:

source: Save unsaved entries when quitting the application
cs: Uložte neuložené položky při ukončení aplikace

source: Clear the search entry when creating a new application entry
cs: Při vytváření nové položky aplikace vymažte položku hledání

source: Added a button to open the entry in a text editor
cs: Přidáno tlačítko pro otevření záznamu v textovém editoru

source: Added a switch to show hidden entries (disabled by default)
cs: Přidán přepínač pro zobrazení skrytých položek (ve výchozím nastavení zakázáno)

source: Fixed some applications like Inkscape not saving their name properly
cs: Opraveno, že některé aplikace, jako je Inkscape, neukládají správně svůj název

source: The main window can be now maximized
cs: Hlavní okno lze nyní maximalizovat

source: Add meson dependency to debian packaging
cs: Přidán meson dependency do debianu

source: Fix debian packaging
cs: Oprava pro debian

source: Initial release
cs: První vydání

source: Edit application entries
cs: Upravte záznamy aplikací

source: Display name
cs: Jméno aplikace

source: Comment
cs: Popis aplikace

source: Show in Launcher
cs: Zobrazit ve spouštěči

source: Category
cs: Kategorie

source: Visibility
cs: Viditelnost

source: Program to execute along with its arguments
cs: Program, který se má spustit spolu s jeho argumenty

source: The working directory to run the program in
cs: Pracovní adresář, ve kterém se má program spustit

source: Command Line
cs: Příkazový řádek

source: Working Directory
cs: Pracovní adresář

source: Launch in Terminal
cs: Spustit v Terminálu

source: Launching
cs: Spouštění

source: Uses Notifications
cs: Používá oznámení

source: Advanced
cs: Pokročilé

source: Save
cs: Uložit

source: Open in Text Editor
cs: Otevřít v Textovém editoru

source: Duplicate
cs: Duplikovat

source: Changes successfully saved
cs: Změny byly úspěšně uloženy

source: Something went wrong and the changes could not be saved: %s
cs: Něco se pokazilo a změny nebylo možné uložit: %s

source: No visible title in the applications menu
cs: V nabídce aplikací není viditelný název

source: No program will be launched
cs: Nebude spuštěn žádný program

source: The executable name (first argument) cannot contain the equal sign
cs: Název spustitelného souboru (první argument) nemůže obsahovat rovnítko

source: Entered file does not exist
cs: Zadaný soubor neexistuje

source: Entered program was not found
cs: Zadaný program nebyl nalezen

source: Do You Want to Delete This Entry?
cs: Chcete tento záznam smazat?

source: Deleting this entry is permanent and cannot be undone. This does not delete the application itself, only the entry shown in the applications menu.
cs: Smazání tohoto záznamu je trvalé a nelze jej vrátit zpět. Tím se neodstraní samotná aplikace, pouze položka zobrazená v nabídce aplikací.

source: Delete
cs: Smazat

source: Do You Want to Restore The Defaults?
cs: Chcete obnovit výchozí nastavení?

source: Restoring defaults will undo all the changes done to this entry.
cs: Obnovení výchozích nastavení vrátí zpět všechny změny provedené u tohoto záznamu.

source: Restore defaults
cs: Obnovit výchozí nastavení

source: Cancel
cs: Zrušit

source: Could Not Open This Entry
cs: Tento záznam nelze otevřít

source: Delete entry…
cs: Smazat záznam…

source: Restore defaults…
cs: Obnovit výchozí nastavení…

source: New Application
cs: Nová aplikace

source: Could not load the newly saved file.
cs: Nově uložený soubor nelze načíst.

source: No Item Selected
cs: Není vybrána žádná položka

source: Select an application or start typing to edit one
cs: Vyberte aplikaci nebo začněte psát a upravte ji

source: Unknown
cs: Neznámý

source: Could not Find "%s"
cs: Nelze najít "%s"

source: Could not Find Requested File
cs: Nelze najít požadovaný soubor

source: File <b>"%s"</b> does not exist.
cs: Soubor <b>"%s"</b> neexistuje.

source: Could Not Create a New Application Entry from "%s"
cs: Nelze vytvořit nový záznam aplikace z "%s"

source: Could Not Create a New Application From Requested File
cs: Nelze vytvořit novou aplikaci z požadovaného souboru

source: Sound & Video
cs: Zvuk a video

source: Sound
cs: Zvuk

source: Programming
cs: Programování

source: Education
cs: Vzdělávání

source: Games
cs: Hry

source: Graphics
cs: Grafika

source: Office
cs: Kancelář

source: Science
cs: Věda

source: Settings
cs: Nastavení

source: System Tools
cs: Systémové nástroje

source: Accessories
cs: Příslušenství

source: Other
cs: Jiné

source: Icon name or path to an image
cs: Název ikony nebo cesta k obrázku

source: Choose from file
cs: Vybrat ze souboru

source: Choose from available icons
cs: Vybrat z dostupných ikon

source: All Files
cs: Všechny soubory

source: Images
cs: Obrázky

source: Select an image
cs: Vybrat obrázek

source: Choose
cs: Vybrat

source: Search icons…
cs: Hledat ikony…

source: Choose an icon from the list
cs: Vybrat ikonu ze seznamu

source: Show hidden entries
cs: Zobrazit skryté položky

source: No Applications Found
cs: Nebyly nalezeny žádné aplikace

source: Could not find any applications to edit on this system
cs: V tomto systému nebyly nalezeny žádné aplikace k úpravě

source: Retry
cs: Opakovat

source: Find…
cs: Najít…

source: New entry
cs: Nová položka

source: Could Not Duplicate %s
cs: Nelze duplikovat %s

source: Could Not Create a New Application Entry
cs: Nepodařilo se vytvořit novou položku
